{
  "backend/AltSignup.mo": "Provides a simple signup handler that validates non-empty username and password and returns a simulated success response.",
  "backend/main.mo": "Defines an actor with access control, allowing users to save and retrieve their profiles with permission checks.",
  "feature_evidence.json": "Describes feature evidence for removing a specific UI element based on XPath, listing affected files and related components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files describing routing, pages, styles, and configuration details.",
  "frontend/index.css": "Empty stylesheet placeholder with no defined content.",
  "frontend/index.html": "HTML entry point that loads fonts, sets Internet Identity configuration into window.process.env, and starts the React app.",
  "frontend/public/.well-known/ii-alternative-origins": "Defines alternative Internet Identity origins for allowed authentication domains.",
  "frontend/public/404.html": "Fallback page that redirects all unknown routes to index.html for SPA routing.",
  "frontend/src/App.tsx": "Configures TanStack Router with the root layout and routes for signup, login, onboarding, and other app pages.",
  "frontend/src/auth/iiConfig.ts": "Provides shared Internet Identity client and login configuration using environment-based II URL and derivation origin.",
  "frontend/src/components/auth/AuthDiagnosticsPanel.tsx": "Renders detailed diagnostics for Internet Identity login state, timing, and stall detection when debugAuth is enabled.",
  "frontend/src/components/auth/AuthErrorPanel.tsx": "Displays a user-friendly auth error message with optional retry and return-to-landing actions.",
  "frontend/src/components/auth/AuthPopupHelpPanel.tsx": "Inline help panel explaining II popup behavior with retry and direct-link actions.",
  "frontend/src/components/auth/AuthStatusBanner.tsx": "Displays live auth-flow status, timing, outcomes, and recovery actions with retry and II link.",
  "frontend/src/components/auth/CanisterWarmupBanner.tsx": "Shows backend warmup state with warming, ready, and failure UI plus retry handling.",
  "frontend/src/components/auth/InternetIdentityAuthorizeCallbackHandler.tsx": "Handles II #authorize callback and routes to onboarding or main app based on stored onboarding result.",
  "frontend/src/components/auth/PatchedInternetIdentityProvider.tsx": "Loads II createOptions before rendering InternetIdentityProvider to ensure safe config initialization.",
  "frontend/src/components/auth/UsernamePasswordAuthForm.tsx": "Empty placeholder file for a username/password auth form.",
  "frontend/src/components/RootLayout.tsx": "Wraps routed pages with the OnboardingResultProvider context.",
  "frontend/src/components/TaskModal.tsx": "Implements a timer-driven modal for tasks with start, pause, resume, and completion handling.",
  "frontend/src/config/ai.ts": "Deprecated AI config wrapper returning dummy values and warning to use proxy client.",
  "frontend/src/contexts/OnboardingResultContext.tsx": "Context for storing, hydrating, and persisting onboarding results in localStorage.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to II identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useAuthAttemptGuard.ts": "Manages lifecycle of a user auth attempt with timestamps, correlation ID, and reset controls.",
  "frontend/src/hooks/useAuthFlowDiagnostics.ts": "Tracks auth flow steps, timing, slow-step detection, and terminal outcomes with diagnostic logging.",
  "frontend/src/hooks/useCanisterWarmup.ts": "Simplified warmup hook that immediately marks readiness when an actor is available, with optional auto-start and retry.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook managing Internet Identity auth lifecycle, including client creation, login flow, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useInternetIdentitySignupTest.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useMobileInternetIdentityLogin.ts": "Mobile-safe II login hook that pre-initializes AuthClient and performs gesture-preserving login with detailed outcome reporting.",
  "frontend/src/hooks/useMobileInternetIdentityLoginPatched.ts": "Patched mobile II login hook using shared configuration for AuthClient and login options, with gesture-preserving login and structured results.",
  "frontend/src/hooks/usePasswordIdentity.tsx": "Password-based identity provider and hook that restores, stores, and manages identities created from username/password credentials.",
  "frontend/src/hooks/usePostAuthTimeout.ts": "Timer hook for post-auth phases that tracks elapsed time, triggers timeout callbacks, and supports resetting.",
  "frontend/src/hooks/useStalledAuthDetection.ts": "Stall detection hook that monitors auth pipeline steps and flags delays based on step-specific timeouts with diagnostic details.",
  "frontend/src/index.css": "Defines global Tailwind layers and a chocolate-themed OKLCH color system, plus base typography and utility classes.",
  "frontend/src/lib/aiClient.ts": "Legacy AI client stub that throws an error and is no longer used.",
  "frontend/src/lib/aiProxyClient.ts": "Implements the frontend client for calling the external AI proxy, including request/response types, validation, and error handling.",
  "frontend/src/lib/onboardingPlaceholder.ts": "Provides onboarding storage key and safe JSON parse/stringify helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, importing global styles.",
  "frontend/src/pages/Daily.tsx": "Daily SweetSteps page that fetches AI‑generated daily tasks and displays loading, error, and task‑interaction states.",
  "frontend/src/pages/Fridge.tsx": "Displays hardcoded chocolate inventory stats with period toggles for week, month, and all‑time.",
  "frontend/src/pages/Landing.tsx": "Landing page with hero content, feature slides, and navigation buttons for signup and login.",
  "frontend/src/pages/Login.tsx": "Handles the full Internet Identity login flow with validation, timeouts, diagnostics, and platform-specific logic before redirecting users based on authentication state.",
  "frontend/src/pages/Onboarding.tsx": "Guides authenticated users through a multi‑step onboarding form, calls an AI API to generate an onboarding plan, and stores the result before redirecting.",
  "frontend/src/pages/Signup.tsx": "Manages user signup via Internet Identity with validation, timeouts, diagnostics, and redirection once an actor is ready.",
  "frontend/src/pages/SignupTest.tsx": "Simple backup signup page that triggers Internet Identity login and redirects to onboarding when authentication succeeds.",
  "frontend/src/pages/SweetSummit.tsx": "Displays the completed onboarding plan to the user and allows navigation back to onboarding if no data is available.",
  "frontend/src/pages/WeeklyMountain.tsx": "Generates or loads the user’s weekly mountain plan based on onboarding data, caches results per week, and handles errors or onboarding reset.",
  "frontend/src/utils/authDiagnostics.ts": "Provides correlation IDs and structured console logging for authentication steps, transitions, outcomes, and slow‑step warnings.",
  "frontend/src/utils/identityValidation.ts": "Validates identities by checking anonymity and delegation freshness, and determines whether a session is stale.",
  "frontend/src/utils/passwordIdentity.ts": "Creates deterministic Ed25519 identities from credentials and handles storing, restoring, and clearing them in localStorage.",
  "frontend/src/utils/platform.ts": "Detects Chrome on Android and caches platform info for mobile-specific auth behavior.",
  "frontend/src/utils/safeRender.ts": "Safely converts arbitrary AI-provided values to displayable strings and offers helpers for validating and extracting string fields.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters, supporting both query and hash-based routing with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Describes current project state, including versions, features, issues, and a pending request to remove a UI element."
}